[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Joey Chua",
        "url": "https://www.linkedin.com/in/joeychuasm/"
      }
    ],
    "date": "2021-01-25",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-25T15:07:18+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-25-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Joey Chua",
        "url": "https://www.linkedin.com/in/joeychuasm/"
      }
    ],
    "date": "2021-01-25",
    "categories": [],
    "contents": "\r\n(a) Clarity and Aesthetics Evaluation\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nAccording to Ben Jones, Data Visualisation can be mapped as a single point using clarity and aesthetics as coordinates. The Clarity axis ranges from confusing to clear, whereas the Aesthetics ranges from ugly to beautiful. The style of Data Visualisation can be placed in any of the four quadrants as shown below.\r\nWhy is it not clear?\r\nAs both the X and Y axis are not labelled, the end-user at first glance would not be able to understand the information that the graph is trying to portray.\r\nX axis has 2 categories (age and LFPR) layered upon 2 different LFPR’s for the 2 years.\r\nTitle is inaccurate; The shown graph states “resident labour force by age” but the actual data is LFPR which measures an economy’s active workforce given using the formula: LFPR= (Labour Force (Employed+Unemployed))/(Labour Force)\r\nThe lead in verbiage is “percent”, and does not describe the graph well\r\nThe graph does not show year-on-year trends\r\nThe graph does not provide a breakdown of the LFPR by gender\r\nThe age groups provided is unable to demonstrate the dependency ratio.\r\nThe chart contains too much information, and there is a lack of a focal point for its centralised message.\r\n__Why is it not “beautiful”?\r\nElements in the chart are not aligned. For instance, the source and note are not centralised;\r\nThe choice of colour is dull and does not make sense. For example, Title and June 2019 line are of the same colour.\r\nUnnecessary information in the chart. For instance, Median Age in (Years) can be shown by using color coordination / representation, but a long phrase was used instead.\r\nNo annotation to identify the age where LFPR lines in 2009 and 2019 intersect.\r\nArrow to indicate shift in median age from 2009 to 2019 is not present.\r\nThe Source of the data is not pertinent to the visualisation and could bear a lighter font as compared to the rest of the image.\r\n(b) Proposed Design Sketches\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nDiverging Population Chart\r\nClarity\r\nClearly labelled x and y axis of age and LFPR respectively\r\nOnly 1 measure (age and LFPR) on each axis\r\nTitle of “Age-Gender LFPR for ” clearly indicates the information to bring across\r\nGraph shows how the genders differ in terms of LFPR across different age groups\r\nFocus of year 2009 and 2019 to compare the differences to avoid cluttering of information\r\nIndicate LFPR values\r\nAesthetics\r\nTo use contrasting colors (on the opposite end of the color spectrum) to indicate the difference in gender, and to facilitate comparison of different categories.\r\nColours are bright and vibrant\r\nRemove unnecessary information\r\nLollipop Chart\r\nClarity\r\nClearly labelled 2 x and y axis of LFPR, Year and Age respectively\r\nOnly 1 measure (age and LFPR) on each axis (including top and bottom)\r\nTitle of “Difference in Mean in 2009 and 2019” clearly indicates the information to bring across\r\nGraph would show how the LFPR falls below or above mean (by skewing left or right)\r\nFocus of year 2009 and 2019 to compare the differences to avoid cluttering of information\r\nLFPR values are indicated in the bubble\r\nAesthetics\r\nColours to contrast positive and negative values are on the opposite spectrum to clearly indicate that they are different and to facilitate comparison of different categories\r\nTo use contrasting colors (on the opposite end of the color spectrum) to indicate the difference in gender, and to facilitate comparison of different categories.\r\nColours are bright and vibrant\r\nUnnecessary information are eliminated\r\nLine Chart\r\nClarity -Clearly labelled x and y axis of year and age groups respectively -Only 1 measure (age and LFPR) on each axis -Title of “Age Group between 2009 and 2019” clearly indicates the information to bring across -Age Groups are binned according to young age, working age and old age to provide better comparison to extract information -LFPR values are indicated at each year Clearly shows the trend across the year\r\nAesthetics - Colours to contrast genders are on the opposite spectrum to clearly indicate that they are different and to facilitate comparison of different categories - Colours are bright and vibrant - Unnecessary information are eliminated\r\n(d) Data Viz Preparation\r\nProvide step-by-step description on how the data visualization was prepared\r\nData\r\n\r\n\r\nknitr::kable(\"T5_T.csv\")\r\n\r\n\r\nx\r\nT5_T.csv\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T10:50:31+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
