[
  {
    "path": "posts/2021-03-20-dataviz-makeover-3/",
    "title": "Dataviz Makeover 3",
    "description": "Assignment 3",
    "author": [
      {
        "name": "Joey Chua",
        "url": "https://www.linkedin.com/in/joeychuasm/"
      }
    ],
    "date": "2021-03-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n(a) Clarity, Aesthetics and Interactivity Evaluation\r\n(b) Proposed Design SketchesBubble Chart\r\nMap\r\nHighlight Table and Bar Chart\r\n\r\n(c) Tableau\r\n(d) Data Viz PreparationFinal Dashboard\r\nData Preparation\r\nMap\r\nHighlight Table\r\nBar Charts\r\nBubble Chart\r\nDashboard\r\nTableau\r\nGithub\r\n\r\n(e) Major ObservationsTrend Over 10 Years\r\nTrend across Southeast Asia\r\nThe Details\r\n\r\n\r\n(a) Clarity, Aesthetics and Interactivity Evaluation\r\nCritic the interactive data visualisation from its clarity, aesthetics and interactivity. At least two from each evaluation criterion.\r\nOver the decades, Southeast Asia has experienced a multitude of conflicts ranging from non-violent strategic developments to violent battles with many fatalities. These conflicts as well as fatalities have been experiencing a growing trend. This could be due to countries’ historical and political landscape, coupled with age-old grievances that are unresolved which perpetuate these episodes of conflicts. Thus, this report seeks to explore the trends of conflicts over the years, and to conduct analysis on these spatio-temporal conflicts across Southeast Asia. This visualisation and analysis can be extended to a global scale, as a means to move towards the UN Sustainable Development Goal 16 to reach an end to violence.\r\nThe Armed Conflict Location & Event Data Project (ACLED) a non-governmental organisation that disaggregated conflict data collection, analysis, and crisis mapping. The conflict events are into 3 general types and 6 sub-event types as shown below.\r\n\r\nClarity, Aesthetics and Interactivity\r\nThe original chart provided does not have clarity, aesthetics and interactivity.\r\n\r\n\r\n\r\n\r\n(b) Proposed Design Sketches\r\nWith reference to the critics above, suggest alternative data visualisation and interactive techniques to improve the current design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\n\r\nBubble Chart\r\n\r\n\r\nMap\r\n\r\n\r\nHighlight Table and Bar Chart\r\n\r\n(c) Tableau\r\nUsing Tableau, design the proposed data visualization.\r\nhttps://public.tableau.com/profile/joey.chua2685#!/\r\n(d) Data Viz Preparation\r\nProvide step-by-step description on how the data visualization was prepared\r\nFinal Dashboard\r\n\r\n\r\n\r\nData Preparation\r\n\r\n\r\nMap\r\n\r\n\r\n\r\n\r\nHighlight Table\r\n\r\n\r\nBar Charts\r\n\r\n\r\nBubble Chart\r\n\r\n\r\n\r\nDashboard\r\n\r\n\r\n\r\n\r\n\r\nTableau\r\n\r\nGithub\r\n\r\n\r\n(e) Major Observations\r\nDescribe 3 major observations revealed by the data visualization prepared.\r\nTrend Over 10 Years\r\n\r\nFrom 2010 to 2020, occurrence of events increased from 1657 to 5227. This number peaked in year 2019, reaching a total of 5875 events. Comparatively in the same period, the total number of fatalities rose from 785 to 2046 and peaked in year 2017. With the occurrences of events and fatalities increasing by over 215% and 160% respectively, this number is set to increase in the coming years.\r\n\r\nFocusing on year 2019 with the greatest number of events occurrences, the above chart shows an evident concentration in 3 countries, Myanmar, Philippines and Thailand with Philippines having the most event occurrences.\r\n The greatest number of fatalities occurred in year 2017. From the map, it can be seen that Philippines has the largest number of fatalities with high concentration. For Myanmar, certain states such as Maungdaw and Laukkaing experienced more fatalities as compared to the other states.\r\nTrend across Southeast Asia\r\nCumulatively, Myanmar, Philippines and Thailand has the greatest number of conflicts with 10482, 11092 and 8503 events. Similarly, Philippines has the greatest number of conflicts, reaching 12,905 across the 10 years.\r\n In 2020, Myanmar has highest number of battle event type, which also contributed to the largest number of fatalities. Riots had the least occurrences, with the smallest number of fatalities.\r\n\r\nPhilippines has a large number of battles and violence against civilians. The latter has resulted in larger number of fatalities as a proportion to event occurrences where fatalities over occurrences is greater than 1.\r\n Thailand’s protests constitute the largest proportion out of other event types with approximately 700 in 2020 compared to others ranging from 0 to 50. However, the number of fatalities for all the events remain low.\r\nThe Details\r\n\r\nAcross the years, event occurrences peak on October Mondays; Fatalities peak on August Tuesdays. Events and fatalities are higher in the second half of the year and in the early days of the week.\r\nIn 2010, event occurrences peaked in the first half of the year, while in 2020 it peaked in the second half of the year. Both exhibited same trend in terms of the days – peak on weekdays versus weekends.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-21T19:29:05+08:00",
    "input_file": "dataviz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-19-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "Assignment 2",
    "author": [
      {
        "name": "Joey Chua",
        "url": "https://www.linkedin.com/in/joeychuasm/"
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n(a) Clarity and Aesthetics Evaluation\r\n(b) Proposed Design SketchesWorld Map\r\nGantt Chart\r\nLikert Chart\r\nError Bar\r\n\r\n(d) Data Viz PreparationFinal Dashboard\r\nData Preparation\r\nWorld Map\r\nGantt Chart\r\nLikert Chart\r\nError Bar\r\nDashboard\r\nTableau Public\r\nGithub and Netlify\r\n\r\n(e) Major ObservationsCase Study in Singapore to reveal observations\r\nSentiments\r\nIndicators\r\n\r\n\r\n(a) Clarity and Aesthetics Evaluation\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nIn 2019, an infection with coronavirus called SARS-CoV-2 emerged and spread globally, causing a global pandemic. According to World Health Organisation (WHO), there have been 108, 579,352 confirmed cases of COVID-19 including 2,396,408 deaths globally as of 15 February 2021. To bring the COVID-19 pandemic to an end, one of the most effective ways to prevent the disease is vaccination. However, the successes of immunisation programmes are moderated by the level of vaccine uptake in the population. Hence, this report aims to understand the willingness of the public on COVID-19 vaccination using the data from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github. However, the extracted graphs do not portray information in a clear and beautiful way.\r\n\r\nClarity and Aesthetics\r\nAccording to Ben Jones, Data Visualisation can be mapped as a single point using clarity and aesthetics as coordinates. The Clarity axis ranges from confusing to clear, whereas the Aesthetics ranges from ugly to beautiful. The style of Data Visualisation can be placed in any of the four quadrants as shown below. The original chart is deemed to be in Quadrant III.\r\n\r\nWhy is it not clear?\r\n\r\n\r\n(b) Proposed Design Sketches\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\n\r\nWorld Map\r\n\r\nGantt Chart\r\n\r\n\r\nLikert Chart\r\n\r\n\r\nError Bar\r\n\r\n\r\n(d) Data Viz Preparation\r\nProvide step-by-step description on how the data visualization was prepared\r\nFinal Dashboard\r\n\r\nData Preparation\r\n\r\n\r\n\r\n\r\n\r\nWorld Map\r\n\r\nGantt Chart\r\n\r\nLikert Chart\r\n\r\n\r\nError Bar\r\n\r\nDashboard\r\n\r\n\r\nTableau Public\r\n\r\nGithub and Netlify\r\n\r\n\r\n(e) Major Observations\r\nDescribe 3 major observations revealed by the data visualization prepared.\r\nCase Study in Singapore to reveal observations\r\nSelect “Question” and “Year” > Select Singapore on the Map\r\n\r\nThe audience can see each country and compare the values to each question based on the distribution. i.e., in addition to the country’s sentiments, it can be compared to other countries using the distribution of squares in the plot.\r\nSentiments\r\n\r\n\r\nIndicators\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T20:30:56+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-25-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Assignment 1",
    "author": [
      {
        "name": "Joey Chua",
        "url": "https://www.linkedin.com/in/joeychuasm/"
      }
    ],
    "date": "2021-01-25",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n(a) Clarity and Aesthetics Evaluation\r\n(b) Proposed Design SketchesLollipop Chart\r\nDiverging Poulation Pyramid Chart\r\nLine Chart\r\n\r\n(d) Data Viz Preparation\r\n(e) Major Observations\r\n\r\n(a) Clarity and Aesthetics Evaluation\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nThe Labour Force in Singapore 2019 Report aims to illustrate the situation of Singapore’s labour force. The information provided by the graph is used by individuals, businesses and policy-makers to understand the various labour transformations in Singapore’s labour market, as well as to formulate policies and programmes. However, the extracted graph does not portray information in a clear and beautiful way.\r\nSource: Comprehensive Labour Force Survey, MOMClarity and Aesthetics\r\nAccording to Ben Jones, Data Visualisation can be mapped as a single point using clarity and aesthetics as coordinates. The Clarity axis ranges from confusing to clear, whereas the Aesthetics ranges from ugly to beautiful. The style of Data Visualisation can be placed in any of the four quadrants as shown below. The original chart is deemed to be in Quadrant III.\r\nBen JonesWhy is it not clear?\r\nNo.\r\nDescription\r\n1\r\nThe chart contains too much information, and there is a lack of a focal point for its centralised message. The chart provides information on 12 age groups ranging from 15 – 19 to 70 & over; LFPR in June 2009 and June 2019; and median age of these two years. Thus, the message and target audience for this chart is unclear.\r\n2\r\nThe title of chart is inaccurate and does not convey the purpose visualisation effectively. The shown graph states “resident labour force by age” but the actual data is LFPR which measures an economy’s active workforce given using the formula: LFPR = (Labour Force (Employed+Unemployed))/(Working Age Population (Age 15 and above)). Hence, readers may be misled.\r\n3\r\nThe lead in verbiage is “per cent”, which does not describe the graph well. It should provide context regarding the data, and provide understanding of chart.\r\n4\r\nX axis has 2 categories - age and LFPR - layered upon 2 different LFPR’s for the 2 years. It is confusing as readers are required to determine which category the visualisation is based on. At the same time, Y axis is missing. As such, users are unable to have reference of the LFPR.\r\n5\r\nAs both the X and Y axis are not labelled, the end-user at first glance would not be able to understand the information that the graph is trying to portray. X axis should have a label “Age Group” and Y axis “Labour Force Participation Rate”.\r\n6\r\nThe graph does not show year-on-year trends. While users can compare 2009 and 2019, there is gap in the knowledge of the trend in between this period. For instance, policy makers may want to study the effectiveness of policy introduced in year 2015 but would be unable to do so. In the case where trends are not mere increase or decrease (i.e. fluctuations), this would not be uncovered.\r\n7\r\nThe graph does not provide a breakdown of the LFPR by gender. Generally, Age-Sex LFPR should be conducted for insightful observations.\r\n8\r\nThe age groups span a large spectrum with 12 groups in total, making it difficult to compare the young age, working age and old age to gain insights.\r\nWhy is it not “beautiful”?\r\nNo.\r\nDescription\r\n1\r\nElements in the chart are not aligned. “Source” and” Note” are not centralized, which may expose unprofessionalism and distrust in the data.\r\n2\r\nChoice of colour is dull, which may not capture the attention of users. In addition, the colour is inadequate in highlighting differences of data in 2009 and 2019. A more contrasting colour such as red and blue could possibly show a greater distinction. Moreover, Title and “June 2019” line are of the same colour. While consistency could be observed, it may lead to confusion if there is any relation between them. Hence, a lighter font for Title could be used.\r\n3\r\nExcessive information in the chart e.g “Median Age in (Years) = 41 Years” could be truncated to increase the appeal of the chart.\r\n4\r\nAnnotation could be used to emphasise important information. For instance, at the years where LFPR lines coincides.\r\n5\r\nShapes such as arrows could be used to provide direction of change. An example is the change in median age from year 2009 to 2019.\r\n(b) Proposed Design Sketches\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nLollipop Chart\r\n\r\n\r\nDiverging Poulation Pyramid Chart\r\n\r\nLine Chart\r\n\r\n(d) Data Viz Preparation\r\nProvide step-by-step description on how the data visualization was prepared\r\n\r\n(e) Major Observations\r\nDescribe 3 major observations revealed by the data visualization prepared.\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T14:55:35+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
