[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Joey Chua",
        "url": "https://www.linkedin.com/in/joeychuasm/"
      }
    ],
    "date": "2021-01-25",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-25T15:07:18+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-25-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Welcome!",
    "author": [
      {
        "name": "Joey Chua",
        "url": "https://www.linkedin.com/in/joeychuasm/"
      }
    ],
    "date": "2021-01-25",
    "categories": [],
    "contents": "\r\n(a) Clarity and Aesthetics Evaluation\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nThe Labour Force in Singapore 2019 Report aims to illustrate the situation of Singapore’s labour force. The information provided by the graph is used by individuals, businesses and policy-makers to understand the various labour transformations in Singapore’s labour market, as well as to formulate policies and programmes. However, the extracted graph does not portray information in a clear and beautiful way.\r\nSource: Comprehensive Labour Force Survey, MOMClarity and Aesthetics\r\nAccording to Ben Jones, Data Visualisation can be mapped as a single point using clarity and aesthetics as coordinates. The Clarity axis ranges from confusing to clear, whereas the Aesthetics ranges from ugly to beautiful. The style of Data Visualisation can be placed in any of the four quadrants as shown below.\r\nBen JonesWhy is it not clear?\r\n\r\nWhy is it not “beautiful”?\r\n\r\n(b) Proposed Design Sketches\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nLollipop Chart\r\n\r\nOTHER CHARTS ARE FOR EXPLORATORY PURPOSES\r\nDiverging Poulation Pyramid Chart\r\n ## Line Chart\r\n\r\n(d) Data Viz Preparation\r\nProvide step-by-step description on how the data visualization was prepared\r\nData\r\n\r\n(e) Major Observations\r\nDescribe 3 major observations revealed by the data visualization prepared.\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-27T18:34:20+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
